//
//  CustomWords.swift
//  ReceiptScanner
//
//  Created by  Vladyslav Fil on 22.01.2023.
//

import Foundation

let kCustomWords: Set<String> = [
    // Символи
    "х", "Х", "#", "Б", "01",
    // Магазини
    "СІЛЬПО-ФУД",
    // Загальні
    "ТОВ", "ПН", "Каса", "Чек", "ЧЕК", "СУМА", "ГРН", "грн", "ПДВ", "КАРТКА", "ІДЕНТ. ЕКВАЙРА", "ТЕРМІНАЛ", "КОМСІЯ", "ПЛАТІЖНА СИСТЕМА", "QR", "ВИД ОПЕРАЦІЇ", "ОПЛАТА", "ЕПЗ", "КОД ABT.", "RRN", "КАСИР:", "ДЕРЖАТЕЛЬ ЕПЗ:", "Восток", "ЗН", "ФН", "ФІСКАЛЬНИЙ ЧЕК", "Екселліо", "ЗНИЖКА",
    // Адреса
    "будинок", "вулиця", "м. Київ", "магазин", "р-н",
    // Сільпо
    "Бали в моб. додатку",
    "Хл300КиївхлСімейнНар", "Рул300КиївхлМакВ/гВу", "КартопляКгБіла", "ЯблукоКгПіноваГолЧер", "Сос275ГлобМортадВсВу", "Смет350MiMiMilk20П/e", "ПакФасовМайНДПЕ",
    // АТБ
    "АТБ-Маркет", "Продукти-695", "email:",
    // Торгові марки
    "Своя Лінія", "Галичина", "Злагода", "Гловино", "Золотко",
    // Продукти
    "Молоко", "Масло", "Сирок", "Лимон", "Банан", "Чорниця", "Голден", "Йогурт", "Оливки чорні", "Оливки зелені", "Масло cолодковершкове селянське", "Минтай філе", "Паста зубна", "Ковбаса", "Салямі", "Карпатська с/к вак/упак", "Крило курчат бройлерів"
]
