//
//  CustomWords.swift
//  ReceiptScanner
//
//  Created by  Vladyslav Fil on 22.01.2023.
//

import Foundation

let kCustomWords: Set<String> = [
    // Символи
    "х", "Х", "#", "Б",
    // Магазини
    "СІЛЬПО-ФУД",
    // Загальні
    "ТОВ", "магазин", "ПН", "Каса", "Чек", "СУМА", "ГРН", "ПДВ", "КАРТКА", "ІДЕНТ. ЕКВАЙРА", "ТЕРМІНАЛ", "КОМСІЯ", "ПЛАТІЖНА СИСТЕМА", "QR", "ВИД ОПЕРАЦІЇ", "ОПЛАТА", "ЕПЗ", "КОД ABT.", "RRN", "КАСИР:", "ДЕРЖАТЕЛЬ ЕПЗ:", "Восток", "ЗН", "ФН", "ФІСКАЛЬНИЙ ЧЕК", "Екселліо",
    // Адреса
    "будинок", "вулиця", "м. Київ",
    // Сільпо
    "Бали в моб. додатку",
    "Хл300КиївхлСімейнНар", "Рул300КиївхлМакВ/гВу", "КартопляКгБіла", "ЯблукоКгПіноваГолЧер", "Сос275ГлобМортадВсВу", "Смет350MiMiMilk20П/e", "ПакФасовМайНДПЕ"
]
