//
//  ExpectedResultExampleSilpo1.swift
//  
//
//  Created by  Vladyslav Fil on 23.05.2023.
//

import Foundation

enum ExpectedResultExampleSilpo1: String {
    case withoutCustomWordsConfigured = "\nТОВ \"СІЛЬПО-ФУД\", магазин\nм. Київ, вулиця Дорогожицька, будинок 2\nПН 407201926538\n00001 Каса Островська 0.Л.\n# ЧЕК N 31/2155/296\nХл300КиївхлСі мейнНар\nРул300КиївхлМакВ/ГВу\nКартопляКгБіла\n1,\n.758 Х 7.59\nЯБлукоктПіноваГ олЧер\n1,62 × 20,99\nСос275Г лобМортадВсВи\nСмет 350MiMiMilk201/e\nПакфасовМайнДГе\n2 X 0,22\nНезабаром здійсниться\nваша дитяча мрія.\nB.B. 28349266\nБали в моб. додатку\nСУМА\nПЛВ Б\n0,00%\nКАРТКА\n- -\nІЛЕНТ. ЕКВАЙРА\nТЕрМТНАЛ\nкОМІСІЯ\nПлатІжна СИСТЕМА\nВИД ОПЕРАЦІЧ\nЕПЗ\nКОД ABT.\nBRN\nКАСИР:\nПЕРЖАТЕЛЬ ЕПЗ:\n01\n#\n14,59 Б\n29,79 Б\n13,34 Б\n34,00 Б\n57,99 Б\n39,99 Б\n0,44 Б\n#\n#\n#\n#\n#\n190,14 ГРН\n0,00\n190,14 ГРН\n- - - .\nQR2929\nQR2029\n0,00\nOR\nОПЛАТА\nXXXXXX4642\n828939\n301718978596\na a о\nВосток\n0633713 0609622\nЗН КС00005950\n#\n17-91-2023 18:40:18\nМН 3999272824\nABOAAAVUAAAAABUACE9h\nAAINWGIMKOoXPi/xtpA=\nФІСКАЛЬНИЙ ЧЕК\nВЕкселліо"
    
    case withCustomWordsConfigured = ""
}
