//
//  ExpectedResultExampleSilpo1.swift
//  
//
//  Created by  Vladyslav Fil on 23.05.2023.
//

import Foundation

enum ExpectedResultExampleSilpo1: String {
    case withoutCustomWordsConfigured = "\nТОВ \"СІЛЬПО-ФУД\", магазин\nм. Київ, вулиця Дорогожицька, будинок 2\nПН 407201926538\n00001 Каса Островська 0.Л.\n# ЧЕК N 31/2155/296\nХл300КиївхлСі мейнНар\nРул300КиївхлМакВ/ГВу\nКартопляКгБіла\n1,\n.758 X 7.59\nЯБлукоктПіноваГ олЧер\n1,62 × 20,99\nСос275Г лобМортадВсВи\nСмет350MiMiMilk201ve\nПакфасовМайнДГе\n2 X 0,22\nНезабаром здійсниться\nваша дитяча мрія.\nB.B. 28349266\nБали в моб. додатку\nСУМА\nПЛВ Б\n0,00%\nКАРТКА\n- .\nІЛЕНТ. ЕКВАЙРА\nТЕрМТНАЛ\nкОМІСІЯ\nПлатІжна СИСТЕМА\nВИД ОПЕРАЦІЧ\nЕПЗ\nКОД ABT.\nBRN\nКАСИР:\nПЕРЖАТЕЛЬ ЕПЗ:\n01\n#\n14,59 Б\n29,79 Б\n13,34 Б\n34,00 Б\n57,99 Б\n39,99 Б\n0,44 Б\n#\n#\n#\n#\n#\n190,14 ГРН\n0,00\n190,14 ГРН\n- - - .\nQR2929\nQR2029\n0,00\nOR\nОПЛАТА\nXXXXXX4642\n828939\n301718978596\nВосток\n0633713 0609622\nЗН КС00005950\n#\n17-91-2023 18:40:18\nМН 3999272824\nABOAAAVUAAAAABUAC69h\nAAINWGIMKOoXPi/xtpA=\nФІСКАЛЬНИЙ ЧЕК\nВЕкселліо"
    
    case withCustomWordsConfigured = "\nТОВ \"СІЛЬПО-ФУД\", магазин\nм. Київ, вулиця Дорогожицька, будинок 2\nПН 407201926538\n00001 Каса Островська 0.Л.\n# ЧЕК N 31/2155/296\nХл300КиївхлСімейнНар\nРул300КиївхлМакВ/ГВу\nКартопляКгБіла\n1,\n.758 X 7.59\nЯБлукокгПіноваГолЧер\n1,62 × 20,99\nСос275ГлобМортадВсВи\nСмет350MiMiMilk201ve\nПакфасовМайнДГе\n2 X 0,22\nНезабаром здійсниться\nваша дитяча мрія.\nB.B. 28349266\nБали в моб. додатку\nСУМА\nПЛВ Б\n0,00%\nКАРТКА\n- .\nІЛЕНТ. ЕКВАЙРА\nТЕрМТНАЛ\nкОМІСІЯ\nПлатІжна СИСТЕМА\nВИД ОПЕРАЦІЧ\nЕПЗ\nКОД ABT.\nBRN\nКАСИР:\nПЕРЖАТЕЛЬ ЕПЗ:\n01\n#\n14,59 Б\n29,79 Б\n13,34 Б\n34,00 Б\n57,99 Б\n39,99 Б\n0,44 Б\n#\n#\n#\n#\n#\n190,14 ГРН\n0,00\n190,14 ГРН\n- - - .\nQR2929\nQR2029\n0,00\nOR\nОПЛАТА\nXXXXXX4642\n828939\n301718978596\nВосток\n0633713 0609622\nЗН КС00005950\n#\n17-91-2023 18:40:18\nМН 3999272824\nABOAAAVUAAAAABUAC69h\nAAINWGIMKOoXPi/xtpA=\nФІСКАЛЬНИЙ ЧЕК\nВ Екселліо"
    
    case extracted =
"""
ТОВ "СІЛЬПО-ФУД", магазин
м. Київ, вулиця Дорогожицька, будинок 2  ПН 407201926538
00001 Каса Островська 0.Л.  01
# ЧЕК N 31/2155/296  #
Хл300КиївхлСімейнНар  14,59 Б
Рул300КиївхлМакВ/ГВу  29,79 Б
КартопляКгБіла
1,  .758 X 7.59  13,34 Б
ЯБлукокгПіноваГолЧер
1,62 × 20,99  34,00 Б
Сос275ГлобМортадВсВи  57,99 Б
Смет350MiMiMilk201ve  39,99 Б
ПакфасовМайнДГе
2 X 0,22  0,44 Б
Незабаром здійсниться  #
ваша дитяча мрія.  #
#
B.B. 28349266  #
Бали в моб. додатку  #
СУМА  190,14 ГРН
ПЛВ Б  0,00%  0,00
КАРТКА  - .  190,14 ГРН  - - - .
ІЛЕНТ. ЕКВАЙРА  QR2929
ТЕрМТНАЛ  QR2029
кОМІСІЯ  0,00
ПлатІжна СИСТЕМА  OR
ВИД ОПЕРАЦІЧ  ОПЛАТА
ЕПЗ  XXXXXX4642
КОД ABT.  828939
BRN  301718978596
КАСИР:
ПЕРЖАТЕЛЬ ЕПЗ:
Восток  #
17-91-2023 18:40:18
0633713 0609622
ЗН КС00005950  МН 3999272824
ABOAAAVUAAAAABUAC69h
AAINWGIMKOoXPi/xtpA=
ФІСКАЛЬНИЙ ЧЕК  В Екселліо
"""
}
