//
//  ExpectedResultExampleSilpo1.swift
//  
//
//  Created by  Vladyslav Fil on 23.05.2023.
//

import Foundation

enum ExpectedResultExampleSilpo1: String {
    case extracted =
"""
ТОВ "СІЛЬПО-ФУД", магазин
м.Київ, вулиця Дорогожицька, будинок 2  ПН 407201926538
00001 Каса Островська О.Л.  01
# ЧЕК N 31/2155/296
Хл300КиївхлСімейнНар  14,59 Б
Рул300КиївхлМакВ/гВу  29,79 Б
КартопляКгБіла
1,758 Х 7,59  13,34 Б
ЯбликоКгПіноваГ олЧер  1,62 X 20,99
Сос275ГлобМортадВсВу  31,00 в
Смет 350МіМіМ120П/е  39,99 Б
ПакфасовМайНДПЕ  2 X 0,22  0,44 Б
Незабаром здійсниться
ваша дитяча мрія.
В.В. 28349266
Бали в моб. додатку  СУМА  190,14 ГРН
ПДВ Б  0,00%  0,00
КАРТКА  -  190,14 ГРН
ІДЕНТ. ЕКВАЙРА  QR2029
ТЕРМІНАЛ  QR2029
КОМІСІЯ  0,00
ПЛАТІЖНА СИСТЕМА
ВИД ОПЕРАЦІЇ  ОПЛАТА
ЕПЗ  XXXXXX4642
КОД АВТ.  828939
RRN  301718978596
КАСИР:
ДЕРЖАТЕЛЬ ЕПЗ:  #
#
Восток
0633713 0609622  17-01-2023 18:40:18
ЗН КС00005950  ОН 3000272824
ABOAAAVUAAAAABUAC69h  AAINWgIMKO0XPi/xtpA=
ФІСКАЛЬНИЙ ЧЕК  ₴ Екселліо
"""
}
